[
    {
        "tag": "institution_overview",
        "patterns": [
            "Tell me about Sanjay Ghodawat Polytechnic",
            "What is SGP?",
            "Overview of your institution",
            "Can you provide information about your college?",
            "What makes SGP unique?",
            "What does Sanjay Ghodawat Polytechnic specialize in?"
        ],
        "responses": [
            "Sanjay Ghodawat Polytechnic (SGP) is a premier technical institution that offers diploma programs in various engineering disciplines. Our institution is committed to delivering high-quality education, fostering innovation, and nurturing talent to prepare students for successful careers.",
            "SGP is renowned for its state-of-the-art infrastructure, experienced faculty, and a holistic approach to education. We emphasize practical learning and provide opportunities for industry exposure and personal development.",
            "At SGP, we believe in creating a learning environment that inspires students to excel academically while developing the skills necessary for a global workforce. Visit our website for more information: https://sgipolytechnic.in/#/"
        ]
    },
    {
        "tag": "first_year_department",
        "patterns": [
            "What is the First Year Department?",
            "Tell me about the First Year Department",
            "Overview of the First Year Department",
            "What departments are available for first-year students?",
            "What courses are offered in the first year?",
            "How does the first-year curriculum work?"
        ],
        "responses": [
            "The First Year Department at SGP is designed to provide students with a strong foundation in engineering principles and essential technical skills. This department focuses on developing core competencies in mathematics, physics, chemistry, and basic engineering subjects.",
            "Our First Year Department serves as a gateway for students to transition from school to a technical education environment, ensuring they are well-prepared for advanced studies in their chosen field.",
            "The curriculum includes comprehensive coursework, practical lab sessions, and hands-on projects to enhance problem-solving and critical thinking skills. Learn more about our First Year Department here: https://sgipolytechnic.in/#/department/fy"
        ]
    },
    {
        "tag": "first_year_hod_message",
        "patterns": [
            "Message from the First Year HOD",
            "What does the First Year HOD say?",
            "First Year Department HOD's message",
            "Can I read the HOD's message for first-year students?",
            "What advice does the First Year HOD provide?"
        ],
        "responses": [
            "The Head of the First Year Department emphasizes the importance of laying a solid foundation for future learning. The message encourages students to adopt a proactive learning approach, seek guidance when needed, and participate in extracurricular activities for holistic development.",
            "The HOD's message highlights the department's commitment to nurturing curiosity and innovation among first-year students, setting the stage for a successful academic journey.",
            "To read the complete message from the First Year HOD, please visit: https://sgipolytechnic.in/#/department/fy/hoddesk"
        ]
    },
    {
        "tag": "cse_department",
        "patterns": [
            "Tell me about the Computer Science Department",
            "What is the CSE Department?",
            "Overview of the Computer Science Engineering Department",
            "What courses are offered in the CSE Department?",
            "What is the focus of the Computer Science Department?",
            "Opportunities in the CSE program"
        ],
        "responses": [
            "The Computer Science and Engineering (CSE) Department at SGP is dedicated to equipping students with knowledge and skills in cutting-edge technologies like artificial intelligence, machine learning, data science, and software development.",
            "Our CSE Department emphasizes a balance between theoretical concepts and practical applications through project-based learning, industry internships, and hands-on labs.",
            "The department offers a curriculum that includes programming, algorithm design, database management, networking, and emerging technologies, preparing students for dynamic careers in tech. For more details, visit: https://sgipolytechnic.in/#/department/cse"
        ]
    },
    {
        "tag": "cse_hod_message",
        "patterns": [
            "Message from the CSE HOD",
            "What does the CSE HOD say?",
            "Computer Science Department HOD's message",
            "Can I read the HOD's message for CSE students?",
            "What are the CSE HOD's insights?"
        ],
        "responses": [
            "The Head of the Computer Science Department shares a vision of creating industry-ready professionals who are well-versed in the latest technologies. The message underlines the importance of research, innovation, and ethics in shaping a student's career.",
            "The CSE HOD's message inspires students to embrace learning as a continuous process, highlighting the department's focus on fostering creativity and technical expertise.",
            "To explore the HOD's complete message and guidance, visit: https://sgipolytechnic.in/#/department/cse/hoddesk"
        ]
    },
    {
        "tag": "cse_vision_mission",
        "patterns": [
            "What is the vision and mission of the CSE Department?",
            "CSE Department's vision and mission",
            "Goals of the Computer Science Department",
            "What are the objectives of the CSE Department?",
            "What does the CSE Department aim to achieve?"
        ],
        "responses": [
            "The vision of the CSE Department is to excel in the field of computer science and engineering by fostering innovation, research, and ethical practices among students.",
            "The mission includes providing a comprehensive education that blends theory with practical applications, encouraging lifelong learning, and contributing to technological advancements for societal benefit.",
            "To learn more about the detailed vision and mission of the department, visit: https://sgipolytechnic.in/#/department/cse/vision-mission"
        ]
    },
    {
        "tag": "cse_academic_calendar",
        "patterns": [
            "What is the academic calendar for the CSE Department?",
            "CSE Department's academic schedule",
            "Important dates for CSE students",
            "Where can I find the CSE academic calendar?",
            "Schedule for the CSE Department"
        ],
        "responses": [
            "The academic calendar for the CSE Department includes details such as semester start and end dates, examination schedules, holidays, and other academic activities.",
            "Students can use the academic calendar to plan their studies and stay informed about key academic milestones throughout the semester.",
            "The full academic calendar is available here: https://sgipolytechnic.in/#/department/cse/academic-calender"
        ]
    },
        {
        "tag": "admission_process",
        "patterns": [
            "How can I apply for admission?",
            "What is the admission procedure?",
            "Steps to enroll in your programs",
            "Guide me through the application process"
        ],
        "responses": [
            "To apply for admission, please visit our Admissions page at https://sgipolytechnic.in/#/admissions. You'll find detailed information on eligibility criteria, required documents, and the application form.",
            "Our admission process involves submitting an online application, providing necessary academic documents, and attending a counseling session. For more details, refer to our Admissions section on the website.",
            "You can start your application by visiting https://sgipolytechnic.in/#/admissions. Ensure you meet the eligibility requirements and have all the necessary documents ready."
        ]
    },
    {
        "tag": "placement_officer_contact",
        "patterns": [
            "Who is the placement officer?",
            "How can I contact the placement cell?",
            "Placement officer's contact details",
            "Get in touch with the placement department"
        ],
        "responses": [
            "Our Training and Placement Officer is Mr. [Name]. You can reach him via email at tpo@sgipolytechnic.in or call at [Phone Number].",
            "For placement-related queries, please contact our Placement Officer, Mr. [Name], at tpo@sgipolytechnic.in or [Phone Number].",
            "To get in touch with the placement cell, email tpo@sgipolytechnic.in or call [Phone Number]. Our Placement Officer, Mr. [Name], will assist you."
        ]
    },
    {
        "tag": "placement_statistics",
        "patterns": [
            "What are the recent placement statistics?",
            "Placement success rate",
            "Companies visiting for placements",
            "Average salary packages offered"
        ],
        "responses": [
            "In the recent academic year, over 80% of our students secured placements with reputed companies. The average salary package offered was around ₹3.25 LPA, with the highest package reaching ₹26 LPA. :contentReference[oaicite:0]{index=0}",
            "Our placement cell has successfully facilitated placements for a significant number of students, with top recruiters like TCS, Capgemini, and L&T Infotech participating in the campus drives. :contentReference[oaicite:1]{index=1}",
            "We have a strong placement record, with numerous companies visiting our campus annually. Detailed placement reports are available on our website."
        ]
    },
    {
        "tag": "hostel_accommodation",
        "patterns": [
            "Tell me about the hostel facilities",
            "Is on-campus accommodation available?",
            "Hostel amenities provided",
            "Living conditions in the hostels"
        ],
        "responses": [
            "Our campus offers separate hostel facilities for male and female students, equipped with spacious rooms, Wi-Fi connectivity, 24/7 security, and recreational areas. :contentReference[oaicite:2]{index=2}",
            "Yes, we provide on-campus accommodation with amenities such as hygienic dining facilities, laundry services, and common rooms for socializing.",
            "The hostels are designed to provide a comfortable living environment, ensuring students have access to all necessary facilities for a conducive stay."
        ]
    },
    {
        "tag": "food_court_details",
        "patterns": [
            "What options are available in the food court?",
            "Tell me about the campus dining facilities",
            "Types of cuisine offered in the cafeteria",
            "Is there a canteen on campus?"
        ],
        "responses": [
            "Our campus features a food court offering a variety of cuisines, including vegetarian and non-vegetarian options, to cater to diverse tastes. :contentReference[oaicite:3]{index=3}",
            "The dining facilities provide hygienic and nutritious meals, with multiple food stalls serving different regional and international dishes.",
            "Yes, we have a well-maintained canteen on campus that operates from 8 AM to 8 PM, ensuring students have access to meals and snacks throughout the day."
        ]
    },
    {
        "tag": "institution_vision",
        "patterns": [
            "What is the vision of your institution?",
            "Tell me about your mission and vision",
            "Institutional goals and objectives",
            "Core values of the college"
        ],
        "responses": [
            "Our vision is to be a leading institution in technical education, fostering innovation, research, and holistic development of students to meet global standards.",
            "We aim to provide quality education, promote research and development, and instill ethical values in our students to prepare them for the challenges of the industry.",
            "Our core values include integrity, excellence, inclusivity, and a commitment to continuous improvement in all aspects of education and administration."
        ]
    },
    {
        "tag": "canteen_food",
        "patterns": [
            "What food is available in the canteen?",
            "Tell me about the canteen menu",
            "Does the canteen have vegetarian options?",
            "What are the canteen timings?"
        ],
        "responses": [
            "Our canteen offers a variety of food options including snacks, beverages, full meals, and desserts. Vegetarian and non-vegetarian options are available to suit diverse preferences.",
            "The canteen is open from 8 AM to 8 PM, serving breakfast, lunch, and dinner. It also offers quick snacks and refreshments throughout the day.",
            "We prioritize hygiene and quality in our food preparation, ensuring nutritious and delicious meals for all students."
        ]
    },
    {
        "tag": "greetings",
        "patterns": [
            "Hi",
            "Hello",
            "Hey",
            "Good morning",
            "Good afternoon",
            "Good evening"
        ],
        "responses": [
            "Hello! Welcome to Sanjay Ghodawat Polytechnic. How can I assist you today?",
            "Hi there! I'm here to help with any questions about our institution.",
            "Greetings! Let me know how I can assist you regarding our college."
        ]
    },
    {
        "tag": "goodbye",
        "patterns": [
            "Bye",
            "Goodbye",
            "See you later",
            "Take care",
            "Thanks, that's all"
        ],
        "responses": [
            "Goodbye! Have a wonderful day ahead.",
            "See you soon! Feel free to reach out if you have more questions.",
            "Take care and all the best in your endeavors!",
            "Bye! It was great assisting you."
        ]
    },
    {
        "tag": "location",
        "patterns": [
            "Where is the college located?",
            "What is your address?",
            "How can I reach the campus?",
            "Tell me about your location"
        ],
        "responses": [
            "We are located at Atigre, Kolhapur, Maharashtra. For a detailed map and directions, visit the Contact Us section on our website.",
            "Our campus address is Atigre, Kolhapur, Maharashtra. You can reach us via public transport, and shuttle services are also available from key locations in the city.",
            "You can find us at Atigre, Kolhapur. For more details, please visit: https://sgipolytechnic.in/#/contact"
        ]
    },
    {
        "tag": "campus_timings",
        "patterns": [
            "What are the campus working hours?",
            "When is the campus open?",
            "Timings of the institution",
            "Office hours of the college"
        ],
        "responses": [
            "The campus is open from 8 AM to 8 PM on weekdays. Administrative offices operate from 9 AM to 5 PM.",
            "Our working hours are from 8 AM to 8 PM, while the library and specific facilities may have extended hours. Please check the relevant sections for more details.",
            "The college remains operational during regular working hours on weekdays. For specific facility timings, kindly refer to our website."
        ]
    },
    {
        "tag": "help_and_support",
        "patterns": [
            "I need help",
            "Can you assist me?",
            "Support required",
            "Help me with some information"
        ],
        "responses": [
            "Of course! Let me know what you need help with, and I'll do my best to assist you.",
            "I'm here to help! Feel free to ask any questions about the college, admissions, facilities, or anything else.",
            "Sure! Please share your query, and I'll provide you with the information you need."
        ]
    },
    {
        "tag": "lost_and_found",
        "patterns": [
            "I lost something on campus",
            "Is there a lost and found office?",
            "Where can I report lost items?",
            "Help me find my lost item"
        ],
        "responses": [
            "If you've lost something on campus, please visit the administration office or contact the security team. They will assist you in locating your lost item.",
            "Lost items are managed by the lost and found section located near the main office. Report your loss with details to facilitate its return.",
            "For lost and found inquiries, kindly reach out to the campus security or administration team."
        ]
    },
    {
        "tag": "parking_facilities",
        "patterns": [
            "Is parking available on campus?",
            "Where can I park my vehicle?",
            "Tell me about parking facilities",
            "Do you have parking spaces?"
        ],
        "responses": [
            "Yes, we have ample parking facilities for both students and staff. Separate parking areas are designated for two-wheelers and four-wheelers.",
            "Parking is available on campus with proper security measures in place. Please ensure your vehicle is parked in the designated areas.",
            "Our campus offers secure parking facilities for all. For more information, check with the campus administration office."
        ]
    },
    {
        "tag": "wifi_availability",
        "patterns": [
            "Is Wi-Fi available on campus?",
            "Do students have access to Wi-Fi?",
            "Internet facilities for students",
            "Can I use Wi-Fi on campus?"
        ],
        "responses": [
            "Yes, our campus is equipped with high-speed Wi-Fi connectivity, accessible to all students and staff.",
            "Wi-Fi is available throughout the campus to ensure seamless internet access for academic and personal use.",
            "Students can connect to the campus Wi-Fi using their official login credentials. For assistance, contact the IT support team."
        ]
    },
    {
        "tag": "emergency_services",
        "patterns": [
            "What should I do in an emergency?",
            "Are there emergency services on campus?",
            "Who to contact during an emergency?",
            "Tell me about campus safety during emergencies"
        ],
        "responses": [
            "In case of an emergency, contact the security office immediately or dial the emergency helpline number displayed on campus.",
            "We have trained staff and medical facilities to handle emergencies. Reach out to the nearest campus security personnel for assistance.",
            "For emergencies, please notify the administration or use the emergency contact numbers provided on your student ID."
        ]
    },
    {
        "tag": "events_and_fests",
        "patterns": [
            "Tell me about college events",
            "What fests are organized on campus?",
            "Upcoming events in college",
            "Do you organize cultural programs?"
        ],
        "responses": [
            "Our college hosts various events, including technical fests, cultural programs, sports meets, and annual day celebrations. Check the Events section on our website for updates.",
            "Yes, we organize several cultural and technical events throughout the year to engage students and showcase their talents.",
            "Upcoming events include [Event Name] and [Fest Name]. For details, visit the Events Calendar on our website."
        ]
    },
    {
        "tag": "student_clubs",
        "patterns": [
            "Do you have student clubs?",
            "Tell me about extracurricular activities",
            "Are there any clubs on campus?",
            "How can I join a student club?"
        ],
        "responses": [
            "Yes, we have a variety of student clubs, including robotics, coding, drama, dance, and literature clubs. Joining a club is a great way to enhance your skills and network.",
            "Extracurricular activities are an integral part of campus life. Explore our student clubs and societies by contacting the Student Affairs office.",
            "We encourage students to join clubs based on their interests. Look out for club meetings and membership drives to participate actively."
        ]
    },
    {
        "tag": "library_rules",
        "patterns": [
            "What are the library rules?",
            "Library policies and guidelines",
            "Can I borrow books from the library?",
            "How many books can I issue at a time?"
        ],
        "responses": [
            "The library allows students to borrow up to 3 books at a time for a period of two weeks. Renewals can be made online if no reservations are pending.",
            "Maintain silence inside the library, and ensure you return borrowed books on time to avoid fines.",
            "For detailed library rules, please visit the library section of our website or contact the library staff."
        ]
    },
    {
        "tag": "scholarships",
        "patterns": [
            "What scholarships are available?",
            "How can I apply for a scholarship?",
            "Tell me about financial aid",
            "Scholarship eligibility criteria"
        ],
        "responses": [
            "We offer a range of scholarships based on academic performance, financial need, and extracurricular achievements. Visit our Scholarships section for more details.",
            "To apply for scholarships, fill out the application form on our website and submit the required documents before the deadline.",
            "Scholarship eligibility criteria vary based on the program. Please check the Scholarships page or contact the Financial Aid office for assistance."
        ]
    },
    {
        "tag": "transportation",
        "patterns": [
            "Is transportation available to the campus?",
            "Tell me about shuttle services",
            "Do you have bus facilities?",
            "How can I commute to college?"
        ],
        "responses": [
            "We provide shuttle services from key locations in the city to the campus. Routes and timings are available on our Transportation page.",
            "Public transportation options like buses and trains are also available to reach the campus. Contact the transportation office for assistance.",
            "For a hassle-free commute, use our college bus services. Detailed schedules can be found on the website."
        ]
    },
    {
        "tag": "attendance_policy",
        "patterns": [
            "What is the attendance policy?",
            "Minimum attendance required",
            "Tell me about attendance rules",
            "What happens if I miss classes?"
        ],
        "responses": [
            "Students are required to maintain a minimum of 75% attendance to be eligible for examinations. Regular attendance is crucial for academic success.",
            "In case of valid reasons for absence, submit a leave application with supporting documents to your department.",
            "Consistent attendance ensures better understanding of course material. For detailed policies, refer to the student handbook."
        ]
    },
    {
        "tag": "examination_schedule",
        "patterns": [
            "When are the exams scheduled?",
            "Tell me about the exam timetable",
            "Where can I find the examination schedule?",
            "Exam dates for this semester"
        ],
        "responses": [
            "The examination schedule is announced at the start of the semester. Please check the Academic Calendar or Examination section on our website.",
            "Exam timetables are displayed on the notice board and uploaded on the student portal. Keep an eye out for updates.",
            "For detailed examination schedules, log in to the student portal or visit the Examination Office."
        ]
    },
    {
        "tag": "mental_health_support",
        "patterns": [
            "Do you offer counseling services?",
            "Who can I talk to for mental health issues?",
            "Tell me about mental health support on campus",
            "Where can I get emotional support?"
        ],
        "responses": [
            "Yes, we have trained counselors available to provide mental health support and guidance. Appointments can be scheduled through the Student Wellness Center.",
            "Our campus promotes mental well-being through workshops, counseling sessions, and peer support programs. Reach out to the wellness office for help.",
            "Mental health is a priority. Confidential support is available for students dealing with stress, anxiety, or other concerns."
        ]
    },
    {
        "tag": "campus_map",
        "patterns": [
            "Where can I find a campus map?",
            "Help me navigate the campus",
            "Do you have a map of the campus?",
            "How do I find buildings on campus?"
        ],
        "responses": [
            "A detailed campus map is available on our website under the Facilities section. You can also pick up a printed map from the reception.",
            "To navigate the campus, download the campus map from our website or ask for assistance at the help desk.",
            "Our campus map includes locations of all departments, hostels, and facilities. Check the Contact or Facilities section online for access."
        ]
    },
    {
        "tag": "holiday_schedule",
        "patterns": [
            "When are the holidays?",
            "What is the holiday schedule?",
            "Are there holidays this semester?",
            "Vacation dates for this year"
        ],
        "responses": [
            "The holiday schedule is outlined in the Academic Calendar available on our website. Please refer to it for semester break and festival holidays.",
            "Upcoming holidays include [Holiday Name and Date]. For a complete list, check the Academic Calendar section online.",
            "Holidays are planned as per the academic schedule. You can view the detailed holiday list in the student portal or on the notice board."
        ]
    },
    {
        "tag": "student_handbook",
        "patterns": [
            "Where can I get the student handbook?",
            "What is included in the student handbook?",
            "Tell me about the student policies",
            "How can I download the college guide?"
        ],
        "responses": [
            "The student handbook is available on the college website under the Student Resources section. It includes policies, procedures, and guidelines.",
            "You can download the student handbook from the Student Resources page. It contains important information about rules, facilities, and academic policies.",
            "The handbook is a comprehensive guide to all aspects of college life. Check the website or contact the administration office for a copy."
        ]
    },
    {
        "tag": "faculty_information",
        "patterns": [
            "Tell me about the faculty",
            "Who are the professors?",
            "Faculty details for my department",
            "How can I contact the faculty?"
        ],
        "responses": [
            "Our faculty members are highly qualified and experienced professionals dedicated to mentoring students. Visit the Faculty section on our website for detailed profiles.",
            "Each department has a team of experts with advanced degrees and industry experience. Contact your department office for specific faculty details.",
            "Faculty contact information is available in the directory on the college website. Reach out to them during their office hours for academic assistance."
        ]
    },
    {
        "tag": "ragging_policy",
        "patterns": [
            "Do you have an anti-ragging policy?",
            "What steps are taken to prevent ragging?",
            "Is the campus ragging-free?",
            "How do you handle ragging complaints?"
        ],
        "responses": [
            "Yes, we strictly enforce an anti-ragging policy to ensure a safe and welcoming environment for all students. Violators face severe disciplinary action.",
            "The campus is ragging-free, and we have committees in place to address any complaints immediately. Students can report incidents anonymously.",
            "To maintain a safe campus, ragging is prohibited under strict guidelines. Contact the Anti-Ragging Committee for assistance."
        ]
    },
    {
        "tag": "medical_emergencies",
        "patterns": [
            "Is there a medical facility on campus?",
            "What to do in case of a medical emergency?",
            "Do you have a health center?",
            "Where can I find a doctor on campus?"
        ],
        "responses": [
            "Yes, we have a health center on campus staffed with medical professionals to handle basic health concerns and emergencies.",
            "In case of a medical emergency, visit the campus health center or contact the security office for immediate assistance.",
            "Our medical facility provides first aid, consultations, and referrals if specialized care is needed."
        ]
    },
    {
        "tag": "course_change",
        "patterns": [
            "Can I change my course after admission?",
            "What is the process for switching programs?",
            "Is it possible to change my department?",
            "How can I switch to another branch?"
        ],
        "responses": [
            "Course changes are subject to availability and approval by the academic committee. Submit a written request to the administration office.",
            "To switch your program, contact your department head for guidance and review the eligibility criteria for the desired course.",
            "Program changes are allowed within the first few weeks of admission. Check the course change policy in the student handbook for details."
        ]
    },
    {
        "tag": "campus_discipline",
        "patterns": [
            "What are the campus discipline rules?",
            "Tell me about code of conduct policies",
            "What behavior is expected from students?",
            "Are there penalties for breaking rules?"
        ],
        "responses": [
            "Students are expected to maintain discipline and follow the college's code of conduct. Any violations may lead to penalties or suspension.",
            "Our code of conduct emphasizes respect, punctuality, and adherence to institutional norms. Details are outlined in the student handbook.",
            "Disciplinary actions are taken for misconduct. To understand acceptable behavior, please refer to the campus rules section on our website."
        ]
    },
    {
        "tag": "research_opportunities",
        "patterns": [
            "Can students participate in research?",
            "What research facilities are available?",
            "How can I get involved in research?",
            "Tell me about research opportunities on campus"
        ],
        "responses": [
            "Yes, students are encouraged to participate in research projects under the guidance of experienced faculty members. Labs and funding are available.",
            "Our campus has dedicated research facilities for various disciplines, allowing students to explore innovative ideas and present findings.",
            "To get involved in research, reach out to your department coordinator or check the Research and Development section on the website."
        ]
    },
    {
        "tag": "alumni_interaction",
        "patterns": [
            "Do you have an alumni network?",
            "Can I interact with alumni?",
            "Tell me about alumni meetups",
            "How can alumni help current students?"
        ],
        "responses": [
            "Yes, we have a strong alumni network that organizes regular meetups and mentorship programs to assist current students.",
            "You can connect with our alumni through dedicated events, the alumni portal, or career mentoring sessions organized by the college.",
            "Our alumni frequently share their experiences and career insights, helping students make informed decisions about their futures."
        ]
    },
    {
        "tag": "part_time_jobs",
        "patterns": [
            "Are there part-time job opportunities on campus?",
            "Can I work while studying?",
            "Tell me about part-time jobs for students",
            "Are there internships available during college?"
        ],
        "responses": [
            "Yes, part-time job opportunities are available on campus in departments like the library, labs, and administration. Contact the Student Support Office for details.",
            "Students can apply for internships and part-time jobs through the Placement Cell or specific department programs.",
            "To balance work and studies, we recommend exploring internships or projects that align with your academic goals."
        ]
    },
    {
        "tag": "study_abroad_programs",
        "patterns": [
            "Do you have international exchange programs?",
            "Can I study abroad during my course?",
            "Tell me about global exposure opportunities",
            "Is there a study abroad program?"
        ],
        "responses": [
            "Yes, we offer international exchange programs in collaboration with partner institutions worldwide. Check the International Office for details.",
            "Our global exposure opportunities include semester exchanges, internships, and study tours. Visit the International Programs section on our website for more.",
            "Students interested in studying abroad can apply through our partnership programs. Guidance and support are available from the International Relations Office."
        ]
    },
    {
        "tag": "student_feedback_mechanism",
        "patterns": [
            "How can I provide feedback?",
            "Is there a system to report issues?",
            "Where can I share my suggestions?",
            "Can I review my teachers or courses?"
        ],
        "responses": [
            "Students can provide feedback through online forms or suggestion boxes placed across the campus. Your input is highly valued.",
            "Feedback about courses, facilities, or faculty can be submitted through the student portal. Anonymous submissions are also accepted.",
            "We encourage students to share constructive feedback to help us improve. Please check the Feedback section on the website for forms."
        ]
    },
    {
        "tag": "counseling_sessions",
        "patterns": [
            "Do you offer career counseling?",
            "How can I book a counseling session?",
            "Is there academic guidance available?",
            "Who can help me choose my career path?"
        ],
        "responses": [
            "Yes, we provide career counseling sessions to help students choose the right path based on their interests and skills. Contact the Career Guidance Office for appointments.",
            "Academic counseling is available to assist students with course selection, exam preparation, and resolving academic challenges.",
            "For personalized guidance, schedule a session with our experienced counselors through the Student Support Portal."
        ]
    },
    {
        "tag": "festival_celebrations",
        "patterns": [
            "Do you celebrate festivals on campus?",
            "What cultural events are organized?",
            "Tell me about festival celebrations",
            "Are there special events during festivals?"
        ],
        "responses": [
            "Yes, we celebrate various festivals such as Diwali, Holi, and Independence Day with cultural programs, decorations, and fun activities.",
            "Festival celebrations on campus bring together students and staff to showcase diverse cultures and traditions.",
            "Join us for lively festival events that include music, dance, and community bonding. Keep an eye on the Events section for updates."
        ]
    },
    {
        "tag": "self_improvement_resources",
        "patterns": [
            "What resources are available for self-improvement?",
            "How can I develop my skills?",
            "Are there personal development programs?",
            "Do you offer workshops for personal growth?"
        ],
        "responses": [
            "We offer numerous resources for self-improvement, including skill development workshops, personality enhancement programs, and leadership training sessions.",
            "Our institution organizes regular seminars and guest lectures on topics like time management, communication skills, and professional growth.",
            "Explore our self-improvement programs through the Student Affairs Office or visit the Events section for upcoming workshops."
        ]
    },
    {
        "tag": "study_tips",
        "patterns": [
            "Can you give me study tips?",
            "How can I study better?",
            "Any advice on preparing for exams?",
            "Tips for staying focused while studying"
        ],
        "responses": [
            "To study effectively, create a dedicated schedule, focus on understanding concepts, and take regular breaks to stay fresh.",
            "Practice active learning by solving problems, summarizing topics, and discussing with peers. It's a great way to retain information.",
            "Prepare for exams by reviewing past papers, staying organized, and prioritizing topics based on weightage."
        ]
    },
    {
        "tag": "work_life_balance",
        "patterns": [
            "How can I manage studies and personal life?",
            "Tips for balancing academics and social life",
            "How do I reduce stress while studying?",
            "Advice on maintaining work-life balance"
        ],
        "responses": [
            "To maintain a balance, plan your schedule wisely, allocate time for relaxation, and engage in activities you enjoy outside of academics.",
            "Regular exercise, meditation, and spending time with friends or family can help you reduce stress and improve productivity.",
            "Remember, it's important to set boundaries for work and personal time. Don't hesitate to seek support from peers or counselors if needed."
        ]
    },
    {
        "tag": "motivation",
        "patterns": [
            "I'm feeling demotivated",
            "How can I stay motivated?",
            "Motivational advice",
            "Help me regain my focus"
        ],
        "responses": [
            "Remember your goals and why you started. Break down your tasks into smaller, achievable steps to build momentum.",
            "Stay motivated by rewarding yourself for completing milestones and surrounding yourself with positive influences.",
            "Focus on progress rather than perfection. Celebrate small wins and keep moving forward!"
        ]
    },
    {
        "tag": "student_life_hacks",
        "patterns": [
            "Can you share some life hacks for students?",
            "Tips for surviving college life",
            "What are some college hacks?",
            "How to make life easier as a student?"
        ],
        "responses": [
            "Keep a planner or use digital tools to stay organized. It can help you track deadlines and assignments easily.",
            "Form study groups to share knowledge and prepare effectively for exams while building friendships.",
            "Make use of campus resources like the library, labs, and counseling centers to optimize your college experience."
        ]
    },
    {
        "tag": "fun_activities",
        "patterns": [
            "What fun activities can I do on campus?",
            "How can I relax between classes?",
            "Are there recreational activities available?",
            "What can I do for fun on campus?"
        ],
        "responses": [
            "Our campus has recreational facilities including sports fields, a gymnasium, and a vibrant student activity center for relaxation and fun.",
            "Join clubs, participate in cultural or sports events, or simply hang out at the cafeteria with friends between classes.",
            "Explore the beautiful green spaces on campus or attend workshops and hobby classes to unwind."
        ]
    },
    {
        "tag": "local_attractions",
        "patterns": [
            "What places can I visit near the campus?",
            "Are there any attractions around?",
            "Tell me about nearby places to explore",
            "Fun things to do outside campus"
        ],
        "responses": [
            "Our campus is close to [Nearby Landmark or Attraction], which is a great spot for weekend outings. You can also explore the city of Kolhapur.",
            "Nearby attractions include temples, shopping centers, and parks. Ask locals for recommendations on the best places to visit.",
            "Take some time to enjoy nearby historical sites, cultural hubs, or scenic spots for a refreshing break."
        ]
    },
    {
        "tag": "time_management",
        "patterns": [
            "How can I manage my time effectively?",
            "Tips for time management as a student",
            "How do I avoid procrastination?",
            "Help me plan my day better"
        ],
        "responses": [
            "Use a planner or apps to schedule your day. Prioritize tasks based on urgency and importance to make the most of your time.",
            "Break your work into smaller chunks and set specific deadlines to avoid procrastination.",
            "Allocate time for both study and relaxation. A balanced routine helps you stay focused and productive."
        ]
    },
    {
        "tag": "personal_finance",
        "patterns": [
            "How can I manage my money as a student?",
            "Tips for budgeting",
            "Help me save money in college",
            "Advice on personal finance for students"
        ],
        "responses": [
            "Track your expenses and set a budget for essentials like food, books, and transport. Use apps to monitor your spending.",
            "Save money by cooking your own meals, using public transport, and taking advantage of student discounts wherever available.",
            "Avoid unnecessary expenses and plan your finances wisely to ensure you have enough for emergencies and important needs."
        ]
    },
    {
        "tag": "chatbot_introduction",
        "patterns": [
            "What is your name?",
            "Do you have a name?",
            "Who created you?",
            "What are you called?"
        ],
        "responses": [
            "I'm the Sanjay Ghodawat Polytechnic Virtual Assistant, here to make your college experience smoother by answering queries and guiding you!",
            "You can call me the SGP Assistant. I’m a chatbot designed to provide helpful information about our institution and campus life.",
            "I’m your virtual guide for all things related to Sanjay Ghodawat Polytechnic. Ask me anything, and I’ll do my best to assist!"
        ]
    },
    {
        "tag": "chatbot_personality",
        "patterns": [
            "Are you a robot?",
            "Do you have emotions?",
            "Are you a human or a machine?",
            "What kind of bot are you?"
        ],
        "responses": [
            "I’m a machine learning-based chatbot programmed to provide information and assistance. While I don’t have emotions, I’m here to help you with anything you need!",
            "I’m not a human, but I’m designed to interact in a friendly and helpful manner. Let me know how I can assist you!",
            "I’m a virtual assistant, not a person, but I’m always ready to provide the support and guidance you’re looking for."
        ]
    }

]
