[
    {
        "tag": "greetings",
        "patterns": [
            "Hi",
            "Hello",
            "Hey there",
            "Good morning",
            "Good evening",
            "What's up?",
            "Greetings"
        ],
        "responses": [
            "Hello! Welcome to Sanjay Ghodawat Polytechnic. How can I assist you today?",
            "Hi there! I'm here to help with any questions about our institution.",
            "Good to see you! Let me know how I can help you today."
        ]
    },
    {
        "tag": "goodbye",
        "patterns": [
            "Bye",
            "Goodbye",
            "See you later",
            "Take care",
            "Catch you later"
        ],
        "responses": [
            "Goodbye! Have a wonderful day ahead.",
            "See you soon! Feel free to reach out if you have more queries.",
            "Take care and best of luck!"
        ]
    },
    {
        "tag": "gratitude",
        "patterns": [
            "Thank you",
            "Thanks",
            "Thanks a lot",
            "Much appreciated",
            "You're great"
        ],
        "responses": [
            "You're welcome! I'm glad I could help.",
            "No problem at all! Let me know if there's anything else you need.",
            "Happy to assist! Feel free to ask if you have more questions."
        ]
    },
    {
        "tag": "general_info",
        "patterns": [
            "What is Sanjay Ghodawat Polytechnic?",
            "Can you give me an overview of your college?",
            "Tell me about your institution",
            "What makes your institution special?"
        ],
        "responses": [
            "Sanjay Ghodawat Polytechnic is a leading institute offering technical education in fields such as Civil, Mechanical, Electrical, and Computer Science. We aim to produce industry-ready professionals with strong academic and practical skills.",
            "Our institution focuses on providing high-quality education, state-of-the-art infrastructure, and fostering innovation and leadership.",
            "Sanjay Ghodawat Polytechnic stands out for its excellent faculty, modern facilities, and a robust placement program preparing students for successful careers."
        ]
    },
    {
        "tag": "admission_process",
        "patterns": [
            "How do I apply?",
            "What is the process to apply for admission?",
            "Can you explain the admission steps?",
            "What are the eligibility criteria for admission?"
        ],
        "responses": [
            "To apply, you'll need to fill out the application form and submit your academic documents. Eligibility criteria include passing the 10th grade (or equivalent) for diploma courses. Visit our admissions section for more details.",
            "Our admission process involves document verification, meeting eligibility criteria, and submitting your application before the deadline. Check our website for specific details.",
            "Eligibility criteria and steps for admission vary based on the program. Please visit our website or contact us for assistance."
        ]
    },
    {
        "tag": "contact_info",
        "patterns": [
            "How can I contact you?",
            "What is your phone number?",
            "Where is your campus located?",
            "Can I get your contact details?"
        ],
        "responses": [
            "You can contact us at 123-456-7890 or email info@sgipolytechnic.in. Our campus is located at Atigre, Kolhapur.",
            "For inquiries, reach out to us via phone or email. We're happy to assist you!",
            "Visit our campus at Atigre, Kolhapur, or contact us through our website for more information."
        ]
    },
    {
        "tag": "placements",
        "patterns": [
            "What about placements?",
            "Do your students get placed?",
            "What companies visit your campus?",
            "Tell me about the placement opportunities"
        ],
        "responses": [
            "Our placement cell has a stellar record of placing students in top companies like Infosys, TCS, and Wipro. We offer extensive training and support for interviews and internships.",
            "Yes, our students secure placements in renowned companies. The placement cell organizes training programs and recruitment drives regularly.",
            "We have tie-ups with leading industries and organize career counseling sessions to ensure our students are industry-ready."
        ]
    },
    {
        "tag": "facilities",
        "patterns": [
            "What facilities does your college offer?",
            "Do you have a library?",
            "Are there sports facilities?",
            "Tell me about the infrastructure."
        ],
        "responses": [
            "Our campus boasts state-of-the-art laboratories, a well-stocked library, sports complexes, and modern classrooms.",
            "We offer excellent infrastructure, including secure Wi-Fi, conference halls, and recreational facilities like a gymnasium and swimming pool.",
            "Our facilities are designed to provide a comprehensive learning experience, including advanced labs, spacious classrooms, and student hostels."
        ]
    },
    {
        "tag": "achievements",
        "patterns": [
            "What are your college achievements?",
            "Have you received any awards?",
            "Tell me about your recognitions."
        ],
        "responses": [
            "Sanjay Ghodawat Polytechnic is recognized as one of the best polytechnic institutes in Maharashtra, with NBA accreditation till 2025.",
            "We have received the 'Ideal Educational Institute' award for outstanding performance in education.",
            "Our institution has achieved numerous accolades, including 'Excellent Grade' by MSBTE and the 'Best Laboratory Award' for our Electrical Department."
        ]
    },
    {
        "tag": "vision_mission",
        "patterns": [
            "What is your vision?",
            "Tell me about your mission statement.",
            "What are your goals as an institution?"
        ],
        "responses": [
            "Our vision is to become a world-class institute of learning and research in engineering and management, achieving academic excellence and fostering innovation.",
            "Our mission is to produce competent professionals with a strong foundation in ethical and social values, equipped to meet global challenges.",
            "We aim to provide high-quality education, state-of-the-art infrastructure, and a supportive learning environment for our students."
        ]
    },
    {
        "tag": "industry_interaction",
        "patterns": [
            "Do you have industry tie-ups?",
            "Tell me about your industry interactions.",
            "Do you provide real-world experience to students?"
        ],
        "responses": [
            "We have strong industry ties and organize guest lectures, internships, and live projects with leading companies.",
            "Our programs include regular industry interactions to keep students updated with current practices and technologies.",
            "We focus on bridging the gap between academia and industry through effective collaborations and exposure to industrial challenges."
        ]
    },
    {
        "tag": "research_development",
        "patterns": [
            "Do you have research programs?",
            "What about innovation and R&D?",
            "Tell me about your development initiatives."
        ],
        "responses": [
            "We encourage students and faculty to participate in research and innovation programs. Our institution supports paper publications and project development.",
            "Our R&D cell is dedicated to fostering creativity and innovation, offering state-of-the-art facilities for research.",
            "We promote developing commercially viable technologies and solutions that address societal challenges."
        ]
    }
]
